// https://ezgif.com/crop
AlchemyElements = [
	
{"Id":"пу","Name":"Пустота","Class":"rotate-slow","Start":true},
{"Id":"по","Name":"Полнота","Class":"rotate-slow"},
{"Id":"разница","Name":"Разница"},
{"Id":"большой_взрыв","Name":"Большой взрыв","Gif":true},
{"Id":"тьма","Name":"Тьма","Class":"dark"},
{"Id":"в","Name":"Время","Gif":true},
{"Id":"э","Name":"Энергия","Class":"energy"},
{"Id":"т","Name":"Температура"},
{"Id":"д","Name":"Давление"},
{"Id":"космологическая_сингулярность","Name":"Космологическая сингулярность","Class":"size-slow"},
{"Id":"гравитация_квантовая","Name":"Квантовая гравитация","Class":"size-slow"},
{"Id":"бозон_x","Name":"Бозон X","Class":"size-slow"},
{"Id":"бозон_y","Name":"Бозон Y","Class":"size-slow"},
{"Id":"кварк","Name":"Кварк","Class":"size-fast"},
{"Id":"лептон","Name":"Лептон","Class":"size-slow"},
{"Id":"фотон","Name":"Фотон","Class":"rotate-slow"},
{"Id":"бозон_w","Name":"Бозон W","Class":"size-slow"},
{"Id":"бозон_z","Name":"Бозон Z","Class":"size-slow"},
{"Id":"глюон","Name":"Глюон"},
{"Id":"бозон_хиггса","Name":"Бозон Хиггса"},
{"Id":"свет","Name":"Свет","Class":"light"},
{"Id":"гравитон","Name":"Гравитон","Class":"size-fast"},
{"Id":"гравитация","Name":"Гравитация"},
{"Id":"эм","Name":"Электромагнетизм","Gif":true},
{"Id":"протон","Name":"Протон"},
{"Id":"электр","Name":"Электрон","Gif":true},
{"Id":"кварк_s","Name":"Кварк S"},
{"Id":"кварк_u","Name":"Кварк U"},
{"Id":"античаст","Name":"Античаститца","Class":"size-slow"},
{"Id":"част","Name":"Частитца","Class":"size-slow"},
{"Id":"адрон","Name":"Адрон"},
{"Id":"кварк_d","Name":"Кварк D"},
{"Id":"кварк_c","Name":"Кварк C"},
{"Id":"кварк_t","Name":"Кварк T"},
{"Id":"кварк_b","Name":"Кварк B"},
{"Id":"нейт","Name":"Нейтрон"},
{"Id":"нуклон","Name":"Нуклон","Class":"rotate-slow"},
{"Id":"атом","Name":"Атом","Gif":true,"Class":"rotate-slow"},
{"Id":"мол","Name":"Молекула","Gif":true},
{"Id":"вещество","Name":"Вещество"},
{"Id":"водород","Name":"Водород"},
{"Id":"тёммат","Name":"Тёмная материя","Class":"size-slow"},
{"Id":"космос","Name":"Космос"},
{"Id":"бож","Name":"Божественная сила","Gif":true,"Class":"bog"},
{"Id":"з","Name":"Земля"},
{"Id":"о","Name":"Огонь","Gif":true,"Class":"size-slow"},
{"Id":"вода","Name":"Вода"},
{"Id":"воздух","Name":"Воздух"},
{"Id":"взрыв","Name":"Взрыв","Gif":true},
{"Id":"эл","Name":"Электричество","Gif":true,"Class":"size-slow"},
{"Id":"электронное_нейтрино","Name":"Электронное нейтрино","Class":"size-slow"},
{"Id":"мюон","Name":"Мюон","Gif":true},
{"Id":"мюонное_нейтрино","Name":"Мюонное нейтрино","Class":"size-slow"},
{"Id":"таулепт","Name":"Тау-лептон","Class":"size-slow"},
{"Id":"таунейт","Name":"Тау-нейтрино","Gif":true,"Class":"size-slow"},

]

AlchemyGroups = {
	"тёмное":["пу","тьма"],
	"светлое":["по","свет"],
	"большой_взрыв_агрессор":["большой_взрыв","по","космос"],
	"бозоны":["бозон_x","бозон_y","бозон_z","бозон_w"],
	"мол-атом":["мол","атом"],
	"для-космоса":["тёммат","тьма","пу"],
	"пустота":["пу","тьма","космос","тёммат"],
	"вещество":["по","вещество"]
}

AlchemyRecipesWet = [
"пу+пу=по,тьма",
"{тёмное}+{светлое}=разница",
"разница+пу=по",
"разница+по=пу",
"по+по=большой_взрыв",
"большой_взрыв+разница=пу",
"большой_взрыв+{большой_взрыв_агрессор}=в,э,т,д,космологическая_сингулярность,гравитация_квантовая,бозон_x,бозон_y,кварк,лептон",
"бозон_x+в=кварк,лептон",
"бозон_x+бозон_x=кварк,лептон",
"бозон_x+бозон_y=фотон,бозон_w,бозон_z,глюон,бозон_хиггса",
"разница+тьма=свет",
"разница+свет=тьма",
"фотон+фотон=свет",
"гравитация_квантовая+гравитация_квантовая=гравитон",
"гравитация_квантовая+в=гравитон",
"гравитон+гравитон=гравитация",
"гравитон+гравитация=гравитация_квантовая",
"гравитация+кварк=гравитация_квантовая",
"гравитация+лептон=гравитация_квантовая",
"гравитация+{бозоны}=гравитация_квантовая,гравитон",
"бозон_хиггса+в=пу",
"бозон_z+бозон_z=гравитация,гравитон,эм",
"бозон_w+бозон_w=гравитация,гравитон,эм",
"бозон_w+бозон_z=протон,электр,кварк_s,кварк_u,античаст",
"античаст+разница=част",
"част+разница=античаст",
"глюон+глюон=гравитон,электр,адрон",
"гравитация_квантовая+гравитон=гравитация",
"гравитация+электр=эм",
"гравитация_квантовая+электр=эм",
"гравитон+электр=эм",
"кварк+кварк=кварк_s,кварк_u,кварк_d,кварк_t,кварк_c,кварк_b",
"кварк_u+кварк_d=протон,нейт",
"нейт+протон=нуклон",
"нуклон+электр=атом",
"атом+атом=мол",
"мол+{мол-атом}=вещество,водород",
"вещество+тьма=тёммат",
"{для-космоса}+{для-космоса}=космос",
"э+{пустота}=бож,большой_взрыв",
"бож+{вещество}=з,о,вода,воздух",
"античаст+част=взрыв",
"электр+электр=эл",
"электр+вещество=эл",
"лептон+лептон=электр,электронное_нейтрино",
"лептон+в=мюон,мюонное_нейтрино",
"электр+в=эл,эм,мюон",
"электронное_нейтрино+в=мюонное_нейтрино",
"мюон+в=таулепт",
"мюонное_нейтрино+в=таунейт"
]

/*=======================================================*/

















/*Сгенерированные рецепты*/
AlchemyRecipes = [
"пу+пу=по,тьма","пу+по=разница","пу+свет=разница",
"тьма+по=разница","тьма+свет=разница","разница+пу=по",
"разница+по=пу","по+по=большой_взрыв","большой_взрыв+разница=пу",
"большой_взрыв+большой_взрыв=в,э,т,д,космологическая_сингулярность,гравитация_квантовая,бозон_x,бозон_y,кварк,лептон","большой_взрыв+по=в,э,т,д,космологическая_сингулярность,гравитация_квантовая,бозон_x,бозон_y,кварк,лептон","большой_взрыв+космос=в,э,т,д,космологическая_сингулярность,гравитация_квантовая,бозон_x,бозон_y,кварк,лептон",
"бозон_x+в=кварк,лептон","бозон_x+бозон_x=кварк,лептон","бозон_x+бозон_y=фотон,бозон_w,бозон_z,глюон,бозон_хиггса",
"разница+тьма=свет","разница+свет=тьма","фотон+фотон=свет",
"гравитация_квантовая+гравитация_квантовая=гравитон","гравитация_квантовая+в=гравитон","гравитон+гравитон=гравитация",
"гравитон+гравитация=гравитация_квантовая","гравитация+кварк=гравитация_квантовая","гравитация+лептон=гравитация_квантовая",
"гравитация+бозон_x=гравитация_квантовая,гравитон","гравитация+бозон_y=гравитация_квантовая,гравитон","гравитация+бозон_z=гравитация_квантовая,гравитон",
"гравитация+бозон_w=гравитация_квантовая,гравитон","бозон_хиггса+в=пу","бозон_z+бозон_z=гравитация,гравитон,эм",
"бозон_w+бозон_w=гравитация,гравитон,эм","бозон_w+бозон_z=протон,электр,кварк_s,кварк_u,античаст","античаст+разница=част",
"част+разница=античаст","глюон+глюон=гравитон,электр,адрон","гравитация_квантовая+гравитон=гравитация",
"гравитация+электр=эм","гравитация_квантовая+электр=эм","гравитон+электр=эм",
"кварк+кварк=кварк_s,кварк_u,кварк_d,кварк_t,кварк_c,кварк_b","кварк_u+кварк_d=протон,нейт","нейт+протон=нуклон",
"нуклон+электр=атом","атом+атом=мол","мол+мол=вещество,водород",
"мол+атом=вещество,водород","вещество+тьма=тёммат","тёммат+тёммат=космос",
"тёммат+тьма=космос","тёммат+пу=космос","тьма+тьма=космос",
"тьма+пу=космос","э+пу=бож,большой_взрыв","э+тьма=бож,большой_взрыв",
"э+космос=бож,большой_взрыв","э+тёммат=бож,большой_взрыв","бож+по=з,о,вода,воздух",
"бож+вещество=з,о,вода,воздух","античаст+част=взрыв","электр+электр=эл",
"электр+вещество=эл","лептон+лептон=электр,электронное_нейтрино","лептон+в=мюон,мюонное_нейтрино",
"электр+в=эл,эм,мюон","электронное_нейтрино+в=мюонное_нейтрино","мюон+в=таулепт",
"мюонное_нейтрино+в=таунейт"
]